tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePost/system/postProcessDict1
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

x1 x_1;
y1 y_1;
z1 z_1;

x2 x_2;
y2 y_2;
z2 z_2;

direction flowdir;

solidName movingWalls;
