tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePost/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    movingWalls;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   movingWalls;
    }

    {
        name    collapsingFaces;
        type    faceSet;
        action  new;
        source  faceToFace;
        set   movingWalls;
    }

    {
        name    movingWalls;
        type    faceSet;
        action delete;
        source collapsingFace;
        tol 2e-5;
    }

    {
        name    collapsingFaces;
        type    faceSet;
        action delete;
        source faceToFace;
        set movingWalls;
    }

);


